{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# DATA 620 - Assignment 3 Alt"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "by: Jeremy OBrien and Mael Illien"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Load a graph database of your choosing from a text file or other source. If you take a large network dataset from the web (such as from Stanford Large Network Dataset Collection (https://snap.stanford.edu/data/)), please feel free at this point to load just a small subset of the nodes and edges.\n",
    "\n",
    "Create basic analysis on the graph, including the graph’s diameter, and at least one other metric of your choosing. You may either code the functions by hand (to build your intuition and insight), or use functions in an existing package.\n",
    "\n",
    "Use a visualization tool of your choice (Neo4j, Gephi, etc.) to display information. Please record a short video (~ 5 minutes), and submit a link to the video in advance of our meet-up."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import random\n",
    "import pandas as pd\n",
    "import networkx as nx\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Data sourced from: https://snap.stanford.edu/data/soc-sign-bitcoin-otc.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>SOURCE</th>\n",
       "      <th>TARGET</th>\n",
       "      <th>RATING</th>\n",
       "      <th>TIMESTAMP</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>1.289242e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>6</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>1.289242e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1</td>\n",
       "      <td>1.289243e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>1.289245e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>13</td>\n",
       "      <td>16</td>\n",
       "      <td>8</td>\n",
       "      <td>1.289254e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35587</th>\n",
       "      <td>4499</td>\n",
       "      <td>1810</td>\n",
       "      <td>1</td>\n",
       "      <td>1.453612e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35588</th>\n",
       "      <td>2731</td>\n",
       "      <td>3901</td>\n",
       "      <td>5</td>\n",
       "      <td>1.453679e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35589</th>\n",
       "      <td>2731</td>\n",
       "      <td>4897</td>\n",
       "      <td>5</td>\n",
       "      <td>1.453679e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35590</th>\n",
       "      <td>13</td>\n",
       "      <td>1128</td>\n",
       "      <td>1</td>\n",
       "      <td>1.453680e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35591</th>\n",
       "      <td>1128</td>\n",
       "      <td>13</td>\n",
       "      <td>2</td>\n",
       "      <td>1.453684e+09</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>35592 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       SOURCE  TARGET  RATING     TIMESTAMP\n",
       "0           6       2       4  1.289242e+09\n",
       "1           6       5       2  1.289242e+09\n",
       "2           1      15       1  1.289243e+09\n",
       "3           4       3       7  1.289245e+09\n",
       "4          13      16       8  1.289254e+09\n",
       "...       ...     ...     ...           ...\n",
       "35587    4499    1810       1  1.453612e+09\n",
       "35588    2731    3901       5  1.453679e+09\n",
       "35589    2731    4897       5  1.453679e+09\n",
       "35590      13    1128       1  1.453680e+09\n",
       "35591    1128      13       2  1.453684e+09\n",
       "\n",
       "[35592 rows x 4 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Import data\n",
    "url = 'https://raw.githubusercontent.com/JeremyOBrien16/CUNY_DATA_620/master/Assignment03/soc-sign-bitcoinotc.csv'\n",
    "ratings = pd.read_csv(url, names=['SOURCE','TARGET','RATING','TIMESTAMP'] )\n",
    "ratings"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Load data into a graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "data = open('soc-sign-bitcoinotc.csv', 'r')\n",
    "graphtype = nx.DiGraph()\n",
    "graph = nx.parse_edgelist(data, \n",
    "                      delimiter=',', \n",
    "                      create_using=graphtype,\n",
    "                      nodetype=int, \n",
    "                      data=(('weight', float),('time', float)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5881"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(graph.nodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "35592"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(graph.edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Expand on this graph as needed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher Query Generation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Randomly sample 10 users\n",
    "unique_users = set(ratings['SOURCE']) # Identify unique users\n",
    "random.seed(620)\n",
    "ratings_subset = ratings[ratings['SOURCE'].isin(random.sample(unique_users, 10))]\n",
    "\n",
    "source_nodes = list(set(ratings_subset['SOURCE']))\n",
    "target_nodes = list(set(ratings_subset['TARGET']))\n",
    "all_nodes = source_nodes + target_nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 29 39\n"
     ]
    }
   ],
   "source": [
    "print(len(source_nodes),len(target_nodes),len(all_nodes))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>SOURCE</th>\n",
       "      <th>TARGET</th>\n",
       "      <th>RATING</th>\n",
       "      <th>TIMESTAMP</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1938</th>\n",
       "      <td>524</td>\n",
       "      <td>359</td>\n",
       "      <td>1</td>\n",
       "      <td>1.305165e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3232</th>\n",
       "      <td>792</td>\n",
       "      <td>202</td>\n",
       "      <td>1</td>\n",
       "      <td>1.306982e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3761</th>\n",
       "      <td>792</td>\n",
       "      <td>7</td>\n",
       "      <td>1</td>\n",
       "      <td>1.307310e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5836</th>\n",
       "      <td>1331</td>\n",
       "      <td>882</td>\n",
       "      <td>4</td>\n",
       "      <td>1.310536e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8912</th>\n",
       "      <td>1852</td>\n",
       "      <td>1771</td>\n",
       "      <td>1</td>\n",
       "      <td>1.331348e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10158</th>\n",
       "      <td>1331</td>\n",
       "      <td>2072</td>\n",
       "      <td>5</td>\n",
       "      <td>1.337048e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10162</th>\n",
       "      <td>2053</td>\n",
       "      <td>2073</td>\n",
       "      <td>2</td>\n",
       "      <td>1.337098e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10249</th>\n",
       "      <td>2053</td>\n",
       "      <td>57</td>\n",
       "      <td>3</td>\n",
       "      <td>1.337532e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10781</th>\n",
       "      <td>2053</td>\n",
       "      <td>1948</td>\n",
       "      <td>1</td>\n",
       "      <td>1.339424e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10947</th>\n",
       "      <td>2053</td>\n",
       "      <td>1352</td>\n",
       "      <td>2</td>\n",
       "      <td>1.339965e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10950</th>\n",
       "      <td>2053</td>\n",
       "      <td>545</td>\n",
       "      <td>2</td>\n",
       "      <td>1.339983e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11673</th>\n",
       "      <td>2053</td>\n",
       "      <td>1719</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.342287e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11674</th>\n",
       "      <td>2053</td>\n",
       "      <td>61</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.342287e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13220</th>\n",
       "      <td>2053</td>\n",
       "      <td>1383</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.346890e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14310</th>\n",
       "      <td>2727</td>\n",
       "      <td>2028</td>\n",
       "      <td>2</td>\n",
       "      <td>1.349189e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14606</th>\n",
       "      <td>2053</td>\n",
       "      <td>1331</td>\n",
       "      <td>-5</td>\n",
       "      <td>1.349874e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18342</th>\n",
       "      <td>2053</td>\n",
       "      <td>1846</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.360116e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20273</th>\n",
       "      <td>792</td>\n",
       "      <td>2642</td>\n",
       "      <td>5</td>\n",
       "      <td>1.364520e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21036</th>\n",
       "      <td>2053</td>\n",
       "      <td>3977</td>\n",
       "      <td>1</td>\n",
       "      <td>1.365544e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21894</th>\n",
       "      <td>4141</td>\n",
       "      <td>2647</td>\n",
       "      <td>9</td>\n",
       "      <td>1.366725e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24231</th>\n",
       "      <td>4485</td>\n",
       "      <td>4402</td>\n",
       "      <td>1</td>\n",
       "      <td>1.372390e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25489</th>\n",
       "      <td>4638</td>\n",
       "      <td>4515</td>\n",
       "      <td>3</td>\n",
       "      <td>1.375474e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25500</th>\n",
       "      <td>4638</td>\n",
       "      <td>1018</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375485e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25502</th>\n",
       "      <td>4638</td>\n",
       "      <td>2067</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375485e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25536</th>\n",
       "      <td>4638</td>\n",
       "      <td>4400</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375582e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27979</th>\n",
       "      <td>4886</td>\n",
       "      <td>4197</td>\n",
       "      <td>1</td>\n",
       "      <td>1.380654e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29190</th>\n",
       "      <td>4886</td>\n",
       "      <td>3452</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385195e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29197</th>\n",
       "      <td>4886</td>\n",
       "      <td>4635</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385230e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29388</th>\n",
       "      <td>4886</td>\n",
       "      <td>5013</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385621e+09</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       SOURCE  TARGET  RATING     TIMESTAMP\n",
       "1938      524     359       1  1.305165e+09\n",
       "3232      792     202       1  1.306982e+09\n",
       "3761      792       7       1  1.307310e+09\n",
       "5836     1331     882       4  1.310536e+09\n",
       "8912     1852    1771       1  1.331348e+09\n",
       "10158    1331    2072       5  1.337048e+09\n",
       "10162    2053    2073       2  1.337098e+09\n",
       "10249    2053      57       3  1.337532e+09\n",
       "10781    2053    1948       1  1.339424e+09\n",
       "10947    2053    1352       2  1.339965e+09\n",
       "10950    2053     545       2  1.339983e+09\n",
       "11673    2053    1719     -10  1.342287e+09\n",
       "11674    2053      61     -10  1.342287e+09\n",
       "13220    2053    1383     -10  1.346890e+09\n",
       "14310    2727    2028       2  1.349189e+09\n",
       "14606    2053    1331      -5  1.349874e+09\n",
       "18342    2053    1846     -10  1.360116e+09\n",
       "20273     792    2642       5  1.364520e+09\n",
       "21036    2053    3977       1  1.365544e+09\n",
       "21894    4141    2647       9  1.366725e+09\n",
       "24231    4485    4402       1  1.372390e+09\n",
       "25489    4638    4515       3  1.375474e+09\n",
       "25500    4638    1018       1  1.375485e+09\n",
       "25502    4638    2067       1  1.375485e+09\n",
       "25536    4638    4400       1  1.375582e+09\n",
       "27979    4886    4197       1  1.380654e+09\n",
       "29190    4886    3452       1  1.385195e+09\n",
       "29197    4886    4635       1  1.385230e+09\n",
       "29388    4886    5013       1  1.385621e+09"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ratings_subset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "ratings_subset = ratings_subset.reset_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>SOURCE</th>\n",
       "      <th>TARGET</th>\n",
       "      <th>RATING</th>\n",
       "      <th>TIMESTAMP</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1938</td>\n",
       "      <td>524</td>\n",
       "      <td>359</td>\n",
       "      <td>1</td>\n",
       "      <td>1.305165e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3232</td>\n",
       "      <td>792</td>\n",
       "      <td>202</td>\n",
       "      <td>1</td>\n",
       "      <td>1.306982e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3761</td>\n",
       "      <td>792</td>\n",
       "      <td>7</td>\n",
       "      <td>1</td>\n",
       "      <td>1.307310e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5836</td>\n",
       "      <td>1331</td>\n",
       "      <td>882</td>\n",
       "      <td>4</td>\n",
       "      <td>1.310536e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>8912</td>\n",
       "      <td>1852</td>\n",
       "      <td>1771</td>\n",
       "      <td>1</td>\n",
       "      <td>1.331348e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>10158</td>\n",
       "      <td>1331</td>\n",
       "      <td>2072</td>\n",
       "      <td>5</td>\n",
       "      <td>1.337048e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>10162</td>\n",
       "      <td>2053</td>\n",
       "      <td>2073</td>\n",
       "      <td>2</td>\n",
       "      <td>1.337098e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>10249</td>\n",
       "      <td>2053</td>\n",
       "      <td>57</td>\n",
       "      <td>3</td>\n",
       "      <td>1.337532e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>10781</td>\n",
       "      <td>2053</td>\n",
       "      <td>1948</td>\n",
       "      <td>1</td>\n",
       "      <td>1.339424e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>10947</td>\n",
       "      <td>2053</td>\n",
       "      <td>1352</td>\n",
       "      <td>2</td>\n",
       "      <td>1.339965e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10950</td>\n",
       "      <td>2053</td>\n",
       "      <td>545</td>\n",
       "      <td>2</td>\n",
       "      <td>1.339983e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>11673</td>\n",
       "      <td>2053</td>\n",
       "      <td>1719</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.342287e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>11674</td>\n",
       "      <td>2053</td>\n",
       "      <td>61</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.342287e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>13220</td>\n",
       "      <td>2053</td>\n",
       "      <td>1383</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.346890e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>14310</td>\n",
       "      <td>2727</td>\n",
       "      <td>2028</td>\n",
       "      <td>2</td>\n",
       "      <td>1.349189e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>14606</td>\n",
       "      <td>2053</td>\n",
       "      <td>1331</td>\n",
       "      <td>-5</td>\n",
       "      <td>1.349874e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>18342</td>\n",
       "      <td>2053</td>\n",
       "      <td>1846</td>\n",
       "      <td>-10</td>\n",
       "      <td>1.360116e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>20273</td>\n",
       "      <td>792</td>\n",
       "      <td>2642</td>\n",
       "      <td>5</td>\n",
       "      <td>1.364520e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>21036</td>\n",
       "      <td>2053</td>\n",
       "      <td>3977</td>\n",
       "      <td>1</td>\n",
       "      <td>1.365544e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>21894</td>\n",
       "      <td>4141</td>\n",
       "      <td>2647</td>\n",
       "      <td>9</td>\n",
       "      <td>1.366725e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>24231</td>\n",
       "      <td>4485</td>\n",
       "      <td>4402</td>\n",
       "      <td>1</td>\n",
       "      <td>1.372390e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>25489</td>\n",
       "      <td>4638</td>\n",
       "      <td>4515</td>\n",
       "      <td>3</td>\n",
       "      <td>1.375474e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>25500</td>\n",
       "      <td>4638</td>\n",
       "      <td>1018</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375485e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>25502</td>\n",
       "      <td>4638</td>\n",
       "      <td>2067</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375485e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>25536</td>\n",
       "      <td>4638</td>\n",
       "      <td>4400</td>\n",
       "      <td>1</td>\n",
       "      <td>1.375582e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>27979</td>\n",
       "      <td>4886</td>\n",
       "      <td>4197</td>\n",
       "      <td>1</td>\n",
       "      <td>1.380654e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>29190</td>\n",
       "      <td>4886</td>\n",
       "      <td>3452</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385195e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>29197</td>\n",
       "      <td>4886</td>\n",
       "      <td>4635</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385230e+09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>29388</td>\n",
       "      <td>4886</td>\n",
       "      <td>5013</td>\n",
       "      <td>1</td>\n",
       "      <td>1.385621e+09</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    index  SOURCE  TARGET  RATING     TIMESTAMP\n",
       "0    1938     524     359       1  1.305165e+09\n",
       "1    3232     792     202       1  1.306982e+09\n",
       "2    3761     792       7       1  1.307310e+09\n",
       "3    5836    1331     882       4  1.310536e+09\n",
       "4    8912    1852    1771       1  1.331348e+09\n",
       "5   10158    1331    2072       5  1.337048e+09\n",
       "6   10162    2053    2073       2  1.337098e+09\n",
       "7   10249    2053      57       3  1.337532e+09\n",
       "8   10781    2053    1948       1  1.339424e+09\n",
       "9   10947    2053    1352       2  1.339965e+09\n",
       "10  10950    2053     545       2  1.339983e+09\n",
       "11  11673    2053    1719     -10  1.342287e+09\n",
       "12  11674    2053      61     -10  1.342287e+09\n",
       "13  13220    2053    1383     -10  1.346890e+09\n",
       "14  14310    2727    2028       2  1.349189e+09\n",
       "15  14606    2053    1331      -5  1.349874e+09\n",
       "16  18342    2053    1846     -10  1.360116e+09\n",
       "17  20273     792    2642       5  1.364520e+09\n",
       "18  21036    2053    3977       1  1.365544e+09\n",
       "19  21894    4141    2647       9  1.366725e+09\n",
       "20  24231    4485    4402       1  1.372390e+09\n",
       "21  25489    4638    4515       3  1.375474e+09\n",
       "22  25500    4638    1018       1  1.375485e+09\n",
       "23  25502    4638    2067       1  1.375485e+09\n",
       "24  25536    4638    4400       1  1.375582e+09\n",
       "25  27979    4886    4197       1  1.380654e+09\n",
       "26  29190    4886    3452       1  1.385195e+09\n",
       "27  29197    4886    4635       1  1.385230e+09\n",
       "28  29388    4886    5013       1  1.385621e+09"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ratings_subset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Sample Cypher Queries:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'MATCH (n) RETURN n'"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return all the nodes\n",
    "\"MATCH (n) RETURN n\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'MATCH (n) DETACH DELETE n'"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete everything\n",
    "\"MATCH (n) DETACH DELETE n\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write node and relationship data to csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Nodes\n",
    "df = pd.DataFrame(all_nodes)\n",
    "df.columns = ['id']\n",
    "df\n",
    "df.to_csv('nodes.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>SOURCE</th>\n",
       "      <th>TARGET</th>\n",
       "      <th>RATING</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>7</td>\n",
       "      <td>34</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>7</td>\n",
       "      <td>6</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>7</td>\n",
       "      <td>29</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>7</td>\n",
       "      <td>13</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35529</th>\n",
       "      <td>1018</td>\n",
       "      <td>5569</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35557</th>\n",
       "      <td>1018</td>\n",
       "      <td>905</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35564</th>\n",
       "      <td>2067</td>\n",
       "      <td>1639</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35565</th>\n",
       "      <td>2067</td>\n",
       "      <td>2045</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35569</th>\n",
       "      <td>1018</td>\n",
       "      <td>2124</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2528 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       SOURCE  TARGET  RATING\n",
       "6           7       5       1\n",
       "42          7      34       1\n",
       "51          7       6       3\n",
       "62          7      29       2\n",
       "76          7      13       1\n",
       "...       ...     ...     ...\n",
       "35529    1018    5569       4\n",
       "35557    1018     905       1\n",
       "35564    2067    1639       1\n",
       "35565    2067    2045       7\n",
       "35569    1018    2124       5\n",
       "\n",
       "[2528 rows x 3 columns]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Edges\n",
    "df = ratings[ratings['SOURCE'].isin(list(all_nodes))]\n",
    "df = df[['SOURCE','TARGET','RATING']]\n",
    "df\n",
    "#df.to_csv('edges.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher data import queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/JeremyOBrien16/CUNY_DATA_620/master/Assignment03/nodes.csv\" AS csvLine\\nCREATE (u:User {id: (csvLine.id)})'"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create nodes\n",
    "\"\"\"LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/JeremyOBrien16/CUNY_DATA_620/master/Assignment03/nodes.csv\" AS csvLine\n",
    "CREATE (u:User {id: (csvLine.id)})\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/JeremyOBrien16/CUNY_DATA_620/master/Assignment03/edges.csv\" AS csvLine\\nMATCH (u1:User {id: csvLine.SOURCE})\\nMATCH (u2:User {id: csvLine.TARGET})\\nCREATE (u1)-[:TRUSTS {rating: csvLine.RATING}]->(u2)'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create relationships\n",
    "\"\"\"LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/JeremyOBrien16/CUNY_DATA_620/master/Assignment03/edges.csv\" AS csvLine\n",
    "MATCH (u1:User {id: csvLine.SOURCE})\n",
    "MATCH (u2:User {id: csvLine.TARGET})\n",
    "CREATE (u1)-[:TRUSTS {rating: csvLine.RATING}]->(u2)\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import from Neo4j into networkx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4jconfig import neo4j_auth\n",
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "gdb = GraphDatabase.driver(uri=neo4j_auth['uri'],auth=(neo4j_auth['user'],neo4j_auth['password']), encrypted=False)\n",
    "session = gdb.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2053 61 -10\n",
      "2053 None -10\n",
      "2053 None 1\n",
      "2053 None -10\n",
      "2053 2073 2\n",
      "2053 None 2\n",
      "2053 None 1\n",
      "2053 None -10\n",
      "2053 None 2\n",
      "2053 None -5\n",
      "2053 57 3\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 13 3\n",
      "41 137 1\n",
      "41 None 3\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 4 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 148 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 2063 1\n",
      "41 None 1\n",
      "41 70 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 89 1\n",
      "41 None 1\n",
      "41 105 1\n",
      "41 141 1\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 60 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 2110 1\n",
      "41 None 1\n",
      "41 4197 2\n",
      "41 None 1\n",
      "41 1 8\n",
      "41 167 1\n",
      "41 None 1\n",
      "41 168 1\n",
      "41 104 1\n",
      "41 None 1\n",
      "41 7 9\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 64 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 147 1\n",
      "41 None 1\n",
      "41 75 1\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 163 1\n",
      "41 157 1\n",
      "41 None 1\n",
      "41 132 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 68 1\n",
      "41 86 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 140 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 83 1\n",
      "41 None 8\n",
      "41 None 1\n",
      "41 162 1\n",
      "41 None 1\n",
      "41 10 4\n",
      "41 None 1\n",
      "41 None 3\n",
      "41 None 1\n",
      "41 110 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 5\n",
      "41 None 1\n",
      "41 36 2\n",
      "41 2089 1\n",
      "41 None 1\n",
      "4141 None 9\n",
      "4164 None 1\n",
      "4164 4105 1\n",
      "4164 None 8\n",
      "4164 None 2\n",
      "2189 None 1\n",
      "2189 2067 1\n",
      "2189 None 1\n",
      "173 149 1\n",
      "173 113 1\n",
      "173 143 1\n",
      "186 204 2\n",
      "186 29 1\n",
      "186 None 1\n",
      "186 None 1\n",
      "186 141 1\n",
      "186 35 2\n",
      "186 183 1\n",
      "186 None 2\n",
      "186 64 1\n",
      "186 None 1\n",
      "186 None 1\n",
      "246 None 1\n",
      "246 35 1\n",
      "246 2125 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2067 1\n",
      "2296 None -1\n",
      "2296 2159 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -5\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 4172 1\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -6\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 2110 1\n",
      "2296 None 4\n",
      "2296 2198 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2125 5\n",
      "2296 None 3\n",
      "2296 None -10\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 2080 -10\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -4\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 4\n",
      "2296 2063 1\n",
      "2296 35 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 135 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 2266 2\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 4\n",
      "2296 None -10\n",
      "2296 4119 8\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 2072 2\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 2262 5\n",
      "2296 None -5\n",
      "2296 1 3\n",
      "2296 None -10\n",
      "2296 57 1\n",
      "2296 None 6\n",
      "2296 None 1\n",
      "2296 None -3\n",
      "2296 None 3\n",
      "2296 None -5\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None -7\n",
      "2296 None 1\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 2419 1\n",
      "2296 4519 1\n",
      "2296 2365 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 202 1\n",
      "2296 None 1\n",
      "2296 4387 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4363 1\n",
      "2296 4275 -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 2\n",
      "2296 2464 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2405 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 353 2\n",
      "2296 None -3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4421 3\n",
      "2296 None 7\n",
      "2296 None -1\n",
      "2296 21 -10\n",
      "2296 2344 1\n",
      "2296 None 2\n",
      "2296 None 3\n",
      "2296 4531 -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 2433 1\n",
      "2296 None -10\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 2393 1\n",
      "2296 4291 6\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4379 -5\n",
      "2296 None 1\n",
      "2296 2485 1\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 2397 1\n",
      "2296 None 1\n",
      "2296 4278 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 2348 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "4375 4197 1\n",
      "4375 None 1\n",
      "4375 4383 1\n",
      "4375 None 3\n",
      "282 206 1\n",
      "282 4 2\n",
      "282 305 1\n",
      "282 306 1\n",
      "282 144 1\n",
      "2373 2173 2\n",
      "2373 2194 2\n",
      "4485 4402 1\n",
      "409 312 1\n",
      "409 148 1\n",
      "409 353 1\n",
      "414 60 5\n",
      "2466 None 1\n",
      "2466 None 2\n",
      "2495 35 5\n",
      "2495 None 10\n",
      "2495 2125 5\n",
      "2512 None 1\n",
      "2512 13 10\n",
      "2512 2164 3\n",
      "469 None 1\n",
      "469 408 1\n",
      "469 None 1\n",
      "469 None 2\n",
      "469 None -10\n",
      "469 925 1\n",
      "469 256 2\n",
      "469 711 1\n",
      "469 None 1\n",
      "469 537 1\n",
      "469 None 1\n",
      "469 None 1\n",
      "469 550 1\n",
      "469 4320 2\n",
      "469 None 1\n",
      "4600 None 1\n",
      "4600 4656 1\n",
      "524 359 1\n",
      "4620 4537 1\n",
      "4638 4515 3\n",
      "4638 4400 1\n",
      "4638 1018 1\n",
      "4638 2067 1\n",
      "4652 2600 1\n",
      "657 570 2\n",
      "675 462 1\n",
      "2727 None 2\n",
      "697 202 4\n",
      "697 144 3\n",
      "697 535 2\n",
      "697 57 1\n",
      "4818 4814 1\n",
      "4839 4862 1\n",
      "4839 4389 1\n",
      "4839 4787 1\n",
      "4860 None 1\n",
      "4860 135 -1\n",
      "4860 4291 -1\n",
      "4860 None 1\n",
      "4860 None -1\n",
      "4860 115 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 2\n",
      "4860 None 5\n",
      "4860 62 -10\n",
      "4860 None -1\n",
      "4860 5157 1\n",
      "4860 None 1\n",
      "4860 5065 3\n",
      "4860 None -1\n",
      "4860 5318 1\n",
      "4860 None 1\n",
      "4860 545 3\n",
      "4860 None 3\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4886 4197 1\n",
      "4886 5013 1\n",
      "4886 None 1\n",
      "4886 4635 1\n",
      "792 7 1\n",
      "792 202 1\n",
      "792 2642 5\n",
      "808 249 1\n",
      "4940 None 1\n",
      "4940 2625 1\n",
      "2905 None 1\n",
      "2905 3018 10\n",
      "1011 273 2\n",
      "1011 None 1\n",
      "1011 7 3\n",
      "1026 908 10\n",
      "1026 489 2\n",
      "1026 832 -1\n",
      "1026 726 1\n",
      "1026 538 1\n",
      "1026 742 1\n",
      "1026 937 2\n",
      "1026 1043 2\n",
      "1026 962 5\n",
      "1131 801 3\n",
      "1131 1185 3\n",
      "3335 3345 1\n",
      "3335 2642 3\n",
      "3335 363 1\n",
      "3335 25 5\n",
      "3335 None 4\n",
      "3335 3656 2\n",
      "3335 2897 1\n",
      "3335 2398 2\n",
      "3335 3219 2\n",
      "3335 4691 1\n",
      "3335 3437 2\n",
      "1331 2072 5\n",
      "1331 882 4\n",
      "1332 1034 2\n",
      "1332 502 3\n",
      "1332 1162 1\n",
      "1332 1312 1\n",
      "1332 978 1\n",
      "1332 468 1\n",
      "1332 905 1\n",
      "3391 202 1\n",
      "3391 3347 1\n",
      "3391 2642 1\n",
      "3391 2397 1\n",
      "3391 2125 1\n",
      "3607 1490 1\n",
      "1568 1546 1\n",
      "1568 1608 1\n",
      "1568 1618 1\n",
      "1568 1598 1\n",
      "1568 1348 2\n",
      "1568 None 1\n",
      "1568 905 1\n",
      "1568 None 1\n",
      "1568 1386 1\n",
      "1568 1663 10\n",
      "1568 None 1\n",
      "1568 None 2\n",
      "1568 1334 1\n",
      "1568 1607 2\n",
      "1568 1383 1\n",
      "1568 1569 2\n",
      "1568 1366 1\n",
      "1568 1585 1\n",
      "1568 None 1\n",
      "3719 481 3\n",
      "3719 None 1\n",
      "3719 546 -10\n",
      "3719 4545 -10\n",
      "3719 3545 1\n",
      "3719 None 1\n",
      "3719 4499 1\n",
      "3719 4531 -10\n",
      "3719 204 -10\n",
      "3719 1612 1\n",
      "3719 None -10\n",
      "3719 4273 1\n",
      "3719 1272 -10\n",
      "3719 4502 -10\n",
      "3719 4334 1\n",
      "3719 None 1\n",
      "3719 2642 4\n",
      "3719 None 1\n",
      "3719 4291 6\n",
      "3719 3465 2\n",
      "3719 4172 1\n",
      "3719 4197 4\n",
      "3719 2306 1\n",
      "3719 4209 1\n",
      "3719 4283 3\n",
      "3719 3598 2\n",
      "3719 4501 -3\n",
      "3719 None 1\n",
      "3719 4534 1\n",
      "3719 4244 1\n",
      "3719 3451 3\n",
      "3719 4925 2\n",
      "3719 4410 -1\n",
      "3719 4400 4\n",
      "3719 13 1\n",
      "3719 None 2\n",
      "3719 2388 2\n",
      "3719 4544 -10\n",
      "3719 3600 2\n",
      "3719 4409 1\n",
      "3719 4651 1\n",
      "3719 3656 1\n",
      "3719 3649 7\n",
      "3719 None 1\n",
      "3719 3345 1\n",
      "3719 2404 1\n",
      "3719 4492 -10\n",
      "3719 5612 1\n",
      "3719 4118 1\n",
      "3719 4831 -10\n",
      "3719 2661 -5\n",
      "3719 2319 1\n",
      "3719 1334 6\n",
      "3719 5299 10\n",
      "3719 3916 1\n",
      "3719 3988 1\n",
      "3719 3815 3\n",
      "3719 4353 1\n",
      "3719 5918 1\n",
      "3719 4412 1\n",
      "3719 4370 2\n",
      "3719 4556 -5\n",
      "3719 4535 -10\n",
      "3719 4290 -5\n",
      "3719 4270 1\n",
      "3719 1639 1\n",
      "3719 1 1\n",
      "3719 4231 2\n",
      "3719 4119 2\n",
      "1852 1771 1\n",
      "5972 13 1\n",
      "4006 3669 1\n",
      "2034 1715 1\n",
      "2034 1317 2\n",
      "2034 1714 2\n",
      "2034 6 1\n",
      "2034 1521 2\n",
      "2034 1334 1\n",
      "2034 1846 1\n",
      "2034 1 1\n",
      "2034 1955 1\n",
      "2034 266 1\n",
      "2034 184 1\n",
      "2034 1584 1\n",
      "2034 2536 1\n",
      "2034 938 1\n",
      "2034 2028 5\n",
      "2034 2582 1\n",
      "2034 546 2\n",
      "2034 2214 5\n",
      "2034 2261 -1\n",
      "2034 2259 1\n",
      "2034 1876 1\n",
      "2034 304 1\n",
      "2034 2198 1\n",
      "2034 2187 1\n"
     ]
    }
   ],
   "source": [
    "# Return all data\n",
    "records = session.run(\"MATCH (n) OPTIONAL MATCH (n)-[r]->() RETURN n, r\")\n",
    "for r in records:\n",
    "    rel = r['r']\n",
    "    if rel is not None:\n",
    "        #print(rel)\n",
    "        print(rel.start_node['id'], rel.end_node['id'], rel['rating'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2053 61 -10\n",
      "2053 None -10\n",
      "2053 None 1\n",
      "2053 None -10\n",
      "2053 2073 2\n",
      "2053 None 2\n",
      "2053 None 1\n",
      "2053 None -10\n",
      "2053 None 2\n",
      "2053 None -5\n",
      "2053 57 3\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 13 3\n",
      "41 137 1\n",
      "41 None 3\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 4 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 148 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 2063 1\n",
      "41 None 1\n",
      "41 70 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 89 1\n",
      "41 None 1\n",
      "41 105 1\n",
      "41 141 1\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 60 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 2110 1\n",
      "41 None 1\n",
      "41 4197 2\n",
      "41 None 1\n",
      "41 1 8\n",
      "41 167 1\n",
      "41 None 1\n",
      "41 168 1\n",
      "41 104 1\n",
      "41 None 1\n",
      "41 7 9\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 64 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 147 1\n",
      "41 None 1\n",
      "41 75 1\n",
      "41 None 2\n",
      "41 None 2\n",
      "41 163 1\n",
      "41 157 1\n",
      "41 None 1\n",
      "41 132 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 68 1\n",
      "41 86 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 140 1\n",
      "41 None 1\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 83 1\n",
      "41 None 8\n",
      "41 None 1\n",
      "41 162 1\n",
      "41 None 1\n",
      "41 10 4\n",
      "41 None 1\n",
      "41 None 3\n",
      "41 None 1\n",
      "41 110 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 2\n",
      "41 None 1\n",
      "41 None 5\n",
      "41 None 1\n",
      "41 36 2\n",
      "41 2089 1\n",
      "41 None 1\n",
      "4141 None 9\n",
      "4164 None 1\n",
      "4164 4105 1\n",
      "4164 None 8\n",
      "4164 None 2\n",
      "2189 None 1\n",
      "2189 2067 1\n",
      "2189 None 1\n",
      "173 149 1\n",
      "173 113 1\n",
      "173 143 1\n",
      "186 204 2\n",
      "186 29 1\n",
      "186 None 1\n",
      "186 None 1\n",
      "186 141 1\n",
      "186 35 2\n",
      "186 183 1\n",
      "186 None 2\n",
      "186 64 1\n",
      "186 None 1\n",
      "186 None 1\n",
      "246 None 1\n",
      "246 35 1\n",
      "246 2125 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2067 1\n",
      "2296 None -1\n",
      "2296 2159 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -5\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 4172 1\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -6\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 2110 1\n",
      "2296 None 4\n",
      "2296 2198 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2125 5\n",
      "2296 None 3\n",
      "2296 None -10\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 2080 -10\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -4\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 4\n",
      "2296 2063 1\n",
      "2296 35 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 135 2\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 2266 2\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 4\n",
      "2296 None -10\n",
      "2296 4119 8\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 2072 2\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 2262 5\n",
      "2296 None -5\n",
      "2296 1 3\n",
      "2296 None -10\n",
      "2296 57 1\n",
      "2296 None 6\n",
      "2296 None 1\n",
      "2296 None -3\n",
      "2296 None 3\n",
      "2296 None -5\n",
      "2296 None 2\n",
      "2296 None -10\n",
      "2296 None -10\n",
      "2296 None -7\n",
      "2296 None 1\n",
      "2296 None 3\n",
      "2296 None 1\n",
      "2296 2419 1\n",
      "2296 4519 1\n",
      "2296 2365 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 202 1\n",
      "2296 None 1\n",
      "2296 4387 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4363 1\n",
      "2296 4275 -10\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 2\n",
      "2296 2464 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 2405 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 353 2\n",
      "2296 None -3\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4421 3\n",
      "2296 None 7\n",
      "2296 None -1\n",
      "2296 21 -10\n",
      "2296 2344 1\n",
      "2296 None 2\n",
      "2296 None 3\n",
      "2296 4531 -10\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 None 3\n",
      "2296 2433 1\n",
      "2296 None -10\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 2\n",
      "2296 None 1\n",
      "2296 2393 1\n",
      "2296 4291 6\n",
      "2296 None -10\n",
      "2296 None 1\n",
      "2296 None 10\n",
      "2296 None 1\n",
      "2296 None 5\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 4379 -5\n",
      "2296 None 1\n",
      "2296 2485 1\n",
      "2296 None -10\n",
      "2296 None -1\n",
      "2296 2397 1\n",
      "2296 None 1\n",
      "2296 4278 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "2296 None -10\n",
      "2296 2348 1\n",
      "2296 None 1\n",
      "2296 None 1\n",
      "4375 4197 1\n",
      "4375 None 1\n",
      "4375 4383 1\n",
      "4375 None 3\n",
      "282 206 1\n",
      "282 4 2\n",
      "282 305 1\n",
      "282 306 1\n",
      "282 144 1\n",
      "2373 2173 2\n",
      "2373 2194 2\n",
      "4485 4402 1\n",
      "409 312 1\n",
      "409 148 1\n",
      "409 353 1\n",
      "414 60 5\n",
      "2466 None 1\n",
      "2466 None 2\n",
      "2495 35 5\n",
      "2495 None 10\n",
      "2495 2125 5\n",
      "2512 None 1\n",
      "2512 13 10\n",
      "2512 2164 3\n",
      "469 None 1\n",
      "469 408 1\n",
      "469 None 1\n",
      "469 None 2\n",
      "469 None -10\n",
      "469 925 1\n",
      "469 256 2\n",
      "469 711 1\n",
      "469 None 1\n",
      "469 537 1\n",
      "469 None 1\n",
      "469 None 1\n",
      "469 550 1\n",
      "469 4320 2\n",
      "469 None 1\n",
      "4600 None 1\n",
      "4600 4656 1\n",
      "524 359 1\n",
      "4620 4537 1\n",
      "4638 4515 3\n",
      "4638 4400 1\n",
      "4638 1018 1\n",
      "4638 2067 1\n",
      "4652 2600 1\n",
      "657 570 2\n",
      "675 462 1\n",
      "2727 None 2\n",
      "697 202 4\n",
      "697 144 3\n",
      "697 535 2\n",
      "697 57 1\n",
      "4818 4814 1\n",
      "4839 4862 1\n",
      "4839 4389 1\n",
      "4839 4787 1\n",
      "4860 None 1\n",
      "4860 135 -1\n",
      "4860 4291 -1\n",
      "4860 None 1\n",
      "4860 None -1\n",
      "4860 115 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 2\n",
      "4860 None 5\n",
      "4860 62 -10\n",
      "4860 None -1\n",
      "4860 5157 1\n",
      "4860 None 1\n",
      "4860 5065 3\n",
      "4860 None -1\n",
      "4860 5318 1\n",
      "4860 None 1\n",
      "4860 545 3\n",
      "4860 None 3\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4860 None 1\n",
      "4886 4197 1\n",
      "4886 5013 1\n",
      "4886 None 1\n",
      "4886 4635 1\n",
      "792 7 1\n",
      "792 202 1\n",
      "792 2642 5\n",
      "808 249 1\n",
      "4940 None 1\n",
      "4940 2625 1\n",
      "2905 None 1\n",
      "2905 3018 10\n",
      "1011 273 2\n",
      "1011 None 1\n",
      "1011 7 3\n",
      "1026 908 10\n",
      "1026 489 2\n",
      "1026 832 -1\n",
      "1026 726 1\n",
      "1026 538 1\n",
      "1026 742 1\n",
      "1026 937 2\n",
      "1026 1043 2\n",
      "1026 962 5\n",
      "1131 801 3\n",
      "1131 1185 3\n",
      "3335 3345 1\n",
      "3335 2642 3\n",
      "3335 363 1\n",
      "3335 25 5\n",
      "3335 None 4\n",
      "3335 3656 2\n",
      "3335 2897 1\n",
      "3335 2398 2\n",
      "3335 3219 2\n",
      "3335 4691 1\n",
      "3335 3437 2\n",
      "1331 2072 5\n",
      "1331 882 4\n",
      "1332 1034 2\n",
      "1332 502 3\n",
      "1332 1162 1\n",
      "1332 1312 1\n",
      "1332 978 1\n",
      "1332 468 1\n",
      "1332 905 1\n",
      "3391 202 1\n",
      "3391 3347 1\n",
      "3391 2642 1\n",
      "3391 2397 1\n",
      "3391 2125 1\n",
      "3607 1490 1\n",
      "1568 1546 1\n",
      "1568 1608 1\n",
      "1568 1618 1\n",
      "1568 1598 1\n",
      "1568 1348 2\n",
      "1568 None 1\n",
      "1568 905 1\n",
      "1568 None 1\n",
      "1568 1386 1\n",
      "1568 1663 10\n",
      "1568 None 1\n",
      "1568 None 2\n",
      "1568 1334 1\n",
      "1568 1607 2\n",
      "1568 1383 1\n",
      "1568 1569 2\n",
      "1568 1366 1\n",
      "1568 1585 1\n",
      "1568 None 1\n",
      "3719 481 3\n",
      "3719 None 1\n",
      "3719 546 -10\n",
      "3719 4545 -10\n",
      "3719 3545 1\n",
      "3719 None 1\n",
      "3719 4499 1\n",
      "3719 4531 -10\n",
      "3719 204 -10\n",
      "3719 1612 1\n",
      "3719 None -10\n",
      "3719 4273 1\n",
      "3719 1272 -10\n",
      "3719 4502 -10\n",
      "3719 4334 1\n",
      "3719 None 1\n",
      "3719 2642 4\n",
      "3719 None 1\n",
      "3719 4291 6\n",
      "3719 3465 2\n",
      "3719 4172 1\n",
      "3719 4197 4\n",
      "3719 2306 1\n",
      "3719 4209 1\n",
      "3719 4283 3\n",
      "3719 3598 2\n",
      "3719 4501 -3\n",
      "3719 None 1\n",
      "3719 4534 1\n",
      "3719 4244 1\n",
      "3719 3451 3\n",
      "3719 4925 2\n",
      "3719 4410 -1\n",
      "3719 4400 4\n",
      "3719 13 1\n",
      "3719 None 2\n",
      "3719 2388 2\n",
      "3719 4544 -10\n",
      "3719 3600 2\n",
      "3719 4409 1\n",
      "3719 4651 1\n",
      "3719 3656 1\n",
      "3719 3649 7\n",
      "3719 None 1\n",
      "3719 3345 1\n",
      "3719 2404 1\n",
      "3719 4492 -10\n",
      "3719 5612 1\n",
      "3719 4118 1\n",
      "3719 4831 -10\n",
      "3719 2661 -5\n",
      "3719 2319 1\n",
      "3719 1334 6\n",
      "3719 5299 10\n",
      "3719 3916 1\n",
      "3719 3988 1\n",
      "3719 3815 3\n",
      "3719 4353 1\n",
      "3719 5918 1\n",
      "3719 4412 1\n",
      "3719 4370 2\n",
      "3719 4556 -5\n",
      "3719 4535 -10\n",
      "3719 4290 -5\n",
      "3719 4270 1\n",
      "3719 1639 1\n",
      "3719 1 1\n",
      "3719 4231 2\n",
      "3719 4119 2\n",
      "1852 1771 1\n",
      "5972 13 1\n",
      "4006 3669 1\n",
      "2034 1715 1\n",
      "2034 1317 2\n",
      "2034 1714 2\n",
      "2034 6 1\n",
      "2034 1521 2\n",
      "2034 1334 1\n",
      "2034 1846 1\n",
      "2034 1 1\n",
      "2034 1955 1\n",
      "2034 266 1\n",
      "2034 184 1\n",
      "2034 1584 1\n",
      "2034 2536 1\n",
      "2034 938 1\n",
      "2034 2028 5\n",
      "2034 2582 1\n",
      "2034 546 2\n",
      "2034 2214 5\n",
      "2034 2261 -1\n",
      "2034 2259 1\n",
      "2034 1876 1\n",
      "2034 304 1\n",
      "2034 2198 1\n",
      "2034 2187 1\n"
     ]
    }
   ],
   "source": [
    "# Return all relationships\n",
    "records = session.run(\"MATCH (n) OPTIONAL MATCH (n)-[r]->() RETURN n, r\")\n",
    "for r in records:\n",
    "    rel = r['r']\n",
    "    if rel is not None:\n",
    "        #print(rel)\n",
    "        print(rel.start_node['id'], rel.end_node['id'], rel['rating'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5621 labels={'User'} properties={'id': '4870'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5690 labels={'User'} properties={'id': '3254'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5360 labels={'User'} properties={'id': '2067'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5680 labels={'User'} properties={'id': '3182'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5393 labels={'User'} properties={'id': '2159'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5778 labels={'User'} properties={'id': '3621'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5530 labels={'User'} properties={'id': '2496'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5489 labels={'User'} properties={'id': '2392'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5785 labels={'User'} properties={'id': '3643'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5682 labels={'User'} properties={'id': '3197'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5627 labels={'User'} properties={'id': '4907'}> rating='-5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5693 labels={'User'} properties={'id': '3273'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5842 labels={'User'} properties={'id': '1815'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5707 labels={'User'} properties={'id': '1316'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5709 labels={'User'} properties={'id': '3366'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5488 labels={'User'} properties={'id': '2388'}> rating='10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5823 labels={'User'} properties={'id': '3767'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5599 labels={'User'} properties={'id': '4800'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5537 labels={'User'} properties={'id': '4569'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5560 labels={'User'} properties={'id': '2590'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5545 labels={'User'} properties={'id': '2550'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5684 labels={'User'} properties={'id': '3219'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5705 labels={'User'} properties={'id': '3353'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5752 labels={'User'} properties={'id': '5576'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5472 labels={'User'} properties={'id': '2346'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5384 labels={'User'} properties={'id': '4172'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5750 labels={'User'} properties={'id': '3496'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5462 labels={'User'} properties={'id': '4375'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5633 labels={'User'} properties={'id': '2897'}> rating='-6'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5759 labels={'User'} properties={'id': '3549'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5590 labels={'User'} properties={'id': '4771'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5377 labels={'User'} properties={'id': '2110'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5587 labels={'User'} properties={'id': '640'}> rating='4'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5413 labels={'User'} properties={'id': '2198'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5467 labels={'User'} properties={'id': '4383'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5500 labels={'User'} properties={'id': '4456'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5385 labels={'User'} properties={'id': '2125'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5793 labels={'User'} properties={'id': '1612'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5487 labels={'User'} properties={'id': '4432'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5738 labels={'User'} properties={'id': '1403'}> rating='10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5493 labels={'User'} properties={'id': '2399'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5697 labels={'User'} properties={'id': '3311'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5665 labels={'User'} properties={'id': '5099'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5651 labels={'User'} properties={'id': '2969'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5638 labels={'User'} properties={'id': '2928'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5841 labels={'User'} properties={'id': '1810'}> rating='10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5711 labels={'User'} properties={'id': '1318'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5540 labels={'User'} properties={'id': '486'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5641 labels={'User'} properties={'id': '2934'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5829 labels={'User'} properties={'id': '3804'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5534 labels={'User'} properties={'id': '4562'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5696 labels={'User'} properties={'id': '1257'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5548 labels={'User'} properties={'id': '2561'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5779 labels={'User'} properties={'id': '3626'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5689 labels={'User'} properties={'id': '3253'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5642 labels={'User'} properties={'id': '2937'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5368 labels={'User'} properties={'id': '2080'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5585 labels={'User'} properties={'id': '2684'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5813 labels={'User'} properties={'id': '1675'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5699 labels={'User'} properties={'id': '1272'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5830 labels={'User'} properties={'id': '1757'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5518 labels={'User'} properties={'id': '2469'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5851 labels={'User'} properties={'id': '3929'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5806 labels={'User'} properties={'id': '3706'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5543 labels={'User'} properties={'id': '2548'}> rating='-4'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5520 labels={'User'} properties={'id': '425'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5668 labels={'User'} properties={'id': '1018'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5524 labels={'User'} properties={'id': '4535'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5659 labels={'User'} properties={'id': '5056'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5644 labels={'User'} properties={'id': '2941'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5739 labels={'User'} properties={'id': '3452'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5620 labels={'User'} properties={'id': '2821'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5698 labels={'User'} properties={'id': '3316'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5579 labels={'User'} properties={'id': '2654'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5653 labels={'User'} properties={'id': '2977'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5755 labels={'User'} properties={'id': '3543'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5685 labels={'User'} properties={'id': '5275'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5525 labels={'User'} properties={'id': '2488'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5594 labels={'User'} properties={'id': '2729'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5811 labels={'User'} properties={'id': '3715'}> rating='4'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5359 labels={'User'} properties={'id': '2063'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5369 labels={'User'} properties={'id': '35'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5831 labels={'User'} properties={'id': '3810'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5853 labels={'User'} properties={'id': '1890'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5615 labels={'User'} properties={'id': '2801'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5868 labels={'User'} properties={'id': '2017'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5400 labels={'User'} properties={'id': '135'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5608 labels={'User'} properties={'id': '729'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5577 labels={'User'} properties={'id': '2644'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5440 labels={'User'} properties={'id': '2266'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5582 labels={'User'} properties={'id': '2680'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5649 labels={'User'} properties={'id': '2961'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5794 labels={'User'} properties={'id': '3661'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5474 labels={'User'} properties={'id': '304'}> rating='4'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5737 labels={'User'} properties={'id': '3449'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5363 labels={'User'} properties={'id': '4119'}> rating='8'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5836 labels={'User'} properties={'id': '3825'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5558 labels={'User'} properties={'id': '2588'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5449 labels={'User'} properties={'id': '2303'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5463 labels={'User'} properties={'id': '2328'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5364 labels={'User'} properties={'id': '2072'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5570 labels={'User'} properties={'id': '2612'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5728 labels={'User'} properties={'id': '1383'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5657 labels={'User'} properties={'id': '2987'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5672 labels={'User'} properties={'id': '1044'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5639 labels={'User'} properties={'id': '2929'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5466 labels={'User'} properties={'id': '2333'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5439 labels={'User'} properties={'id': '2262'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5869 labels={'User'} properties={'id': '2028'}> rating='-5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5351 labels={'User'} properties={'id': '1'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5583 labels={'User'} properties={'id': '2682'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5374 labels={'User'} properties={'id': '57'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5634 labels={'User'} properties={'id': '2898'}> rating='6'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5764 labels={'User'} properties={'id': '3571'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5731 labels={'User'} properties={'id': '3436'}> rating='-3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5564 labels={'User'} properties={'id': '2600'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5740 labels={'User'} properties={'id': '5501'}> rating='-5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5843 labels={'User'} properties={'id': '1819'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5768 labels={'User'} properties={'id': '1543'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5584 labels={'User'} properties={'id': '2683'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5495 labels={'User'} properties={'id': '4450'}> rating='-7'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5687 labels={'User'} properties={'id': '1201'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5666 labels={'User'} properties={'id': '3054'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5562 labels={'User'} properties={'id': '546'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5502 labels={'User'} properties={'id': '2419'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5519 labels={'User'} properties={'id': '4519'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5483 labels={'User'} properties={'id': '2365'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5801 labels={'User'} properties={'id': '3682'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5573 labels={'User'} properties={'id': '2625'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5825 labels={'User'} properties={'id': '1731'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5434 labels={'User'} properties={'id': '202'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5814 labels={'User'} properties={'id': '3729'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5469 labels={'User'} properties={'id': '4387'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5595 labels={'User'} properties={'id': '2733'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5677 labels={'User'} properties={'id': '3114'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5457 labels={'User'} properties={'id': '4363'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5425 labels={'User'} properties={'id': '4275'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5810 labels={'User'} properties={'id': '3714'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5799 labels={'User'} properties={'id': '3676'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5602 labels={'User'} properties={'id': '2763'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5646 labels={'User'} properties={'id': '2944'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5515 labels={'User'} properties={'id': '2464'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5572 labels={'User'} properties={'id': '571'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5565 labels={'User'} properties={'id': '4649'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5839 labels={'User'} properties={'id': '1792'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5722 labels={'User'} properties={'id': '3414'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5498 labels={'User'} properties={'id': '2405'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5726 labels={'User'} properties={'id': '5472'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5616 labels={'User'} properties={'id': '2803'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5645 labels={'User'} properties={'id': '2942'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5494 labels={'User'} properties={'id': '353'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5702 labels={'User'} properties={'id': '3341'}> rating='-3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5832 labels={'User'} properties={'id': '1765'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5661 labels={'User'} properties={'id': '5064'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5485 labels={'User'} properties={'id': '4421'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5647 labels={'User'} properties={'id': '905'}> rating='7'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5654 labels={'User'} properties={'id': '5027'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5361 labels={'User'} properties={'id': '21'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5471 labels={'User'} properties={'id': '2344'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5614 labels={'User'} properties={'id': '2794'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5591 labels={'User'} properties={'id': '2725'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5521 labels={'User'} properties={'id': '4531'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5681 labels={'User'} properties={'id': '3195'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5774 labels={'User'} properties={'id': '1562'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5575 labels={'User'} properties={'id': '2642'}> rating='3'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5505 labels={'User'} properties={'id': '2433'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5600 labels={'User'} properties={'id': '4802'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5796 labels={'User'} properties={'id': '5712'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5643 labels={'User'} properties={'id': '4986'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5678 labels={'User'} properties={'id': '3145'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5604 labels={'User'} properties={'id': '2767'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5569 labels={'User'} properties={'id': '2609'}> rating='2'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5593 labels={'User'} properties={'id': '2728'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5490 labels={'User'} properties={'id': '2393'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5432 labels={'User'} properties={'id': '4291'}> rating='6'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5803 labels={'User'} properties={'id': '3699'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5783 labels={'User'} properties={'id': '3640'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5720 labels={'User'} properties={'id': '1363'}> rating='10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5700 labels={'User'} properties={'id': '3326'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5870 labels={'User'} properties={'id': '2030'}> rating='5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5581 labels={'User'} properties={'id': '2679'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5787 labels={'User'} properties={'id': '3648'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5549 labels={'User'} properties={'id': '2563'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5465 labels={'User'} properties={'id': '4379'}> rating='-5'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5586 labels={'User'} properties={'id': '2688'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5522 labels={'User'} properties={'id': '2485'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5816 labels={'User'} properties={'id': '3744'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5719 labels={'User'} properties={'id': '3410'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5491 labels={'User'} properties={'id': '2397'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5632 labels={'User'} properties={'id': '2893'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5426 labels={'User'} properties={'id': '4278'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5539 labels={'User'} properties={'id': '481'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5866 labels={'User'} properties={'id': '4011'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5629 labels={'User'} properties={'id': '4926'}> rating='-1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5635 labels={'User'} properties={'id': '2901'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5795 labels={'User'} properties={'id': '1616'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5611 labels={'User'} properties={'id': '2784'}> rating='-10'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5473 labels={'User'} properties={'id': '2348'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5852 labels={'User'} properties={'id': '1885'}> rating='1'>\n",
      "<Record u1=<Node id=5446 labels={'User'} properties={'id': '2296'}> u2=<Node id=5735 labels={'User'} properties={'id': '3444'}> rating='1'>\n"
     ]
    }
   ],
   "source": [
    "result = session.run(\"MATCH (u1:User {id: '2296'})-[r:TRUSTS]->(u2) RETURN u1, u2, r.rating AS rating\")\n",
    "for r in result:\n",
    "    print(r)\n",
    "    #print(r['u1'], r['u2'].id, r['rating'])\n",
    "    #print(r['u1'].id, r['u2'].id, r['rating'])\n",
    "    \n",
    "#ratings = [(record[\"rating\"] for record in result]\n",
    "#ratings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = session.run(\"MATCH (u:User) RETURN u.id AS id\")\n",
    "ids = [record[\"id\"] for record in result]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Used in graphing\n",
    "labels = []\n",
    "node_ids = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (<ipython-input-26-9af75aa36edd>, line 6)",
     "output_type": "error",
     "traceback": [
      "\u001b[0;36m  File \u001b[0;32m\"<ipython-input-26-9af75aa36edd>\"\u001b[0;36m, line \u001b[0;32m6\u001b[0m\n\u001b[0;31m    if node not in :\u001b[0m\n\u001b[0m                   ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": [
    "def rec2graph(rs):\n",
    "    graph = nx.MultiDiGraph()\n",
    "    \n",
    "    for record in rs:\n",
    "        node = record['n']\n",
    "        if node not in :\n",
    "            nx_properties = {}\n",
    "            graph.add_node(node.id, **nx_properties)\n",
    "            \n",
    "            node_ids.append(node.id)\n",
    "            labels.append(node.get('id'))\n",
    "        \n",
    "        rel = record['r']\n",
    "        #print(rel)\n",
    "        \n",
    "        #query = \"MATCH (u1:User {id: '%s'})-[r:TRUSTS]->(u2) RETURN u1, u2, r.rating AS rating\" % (node.id)\n",
    "        #result = session.run(query)    \n",
    "        \n",
    "        if rel is not None:\n",
    "                #relationship = record['r']\n",
    "                graph.add_edge(rel.start_node['id'], rel.end_node['id'], weight=rel['rating'])\n",
    "                    #relationship.start_node.id, relationship.end_node.id, key=relationship.type, weight=relationship.rating\n",
    "            \n",
    "    return graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "records = session.run(\"MATCH (n) OPTIONAL MATCH (n)-[r]->() RETURN n, r\")\n",
    "g = rec2graph(records)\n",
    "print(nx.info(g))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "plt.rcParams['figure.figsize'] = [20, 10]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Simple graph\n",
    "nx.draw(g, with_labels=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_pos = nx.spring_layout(g)\n",
    "labels = dict(zip(node_ids,labels))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "fig = nx.draw_networkx_nodes(g, graph_pos, alpha=.5, node_color='blue')\n",
    "fig = nx.draw_networkx_edges(g, graph_pos, width=1, alpha=.3, edge_color='blue')\n",
    "fig = nx.draw_networkx_labels(g, graph_pos, labels=labels, font_size=10, font_family='Arial')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.DataFrame(index=ids)\n",
    "pagerank = nx.pagerank(g, alpha=.9)\n",
    "df['pagerank'] = [pagerank[n] for n in ids]\n",
    "\n",
    "betweenness = nx.betweenness_centrality(g)\n",
    "df['betweenness'] = [betweenness[n] for n in ids]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "nx.diameter(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
